# pandas, matplotlib, seaborn

Установим и обновим требуемые библиотеки до последних версий. Флажок -q (quiet) - не выводить ничего.

In [9]:
!pip install -q --upgrade numpy pandas sklearn pyarrow matplotlib seaborn

WARNING: You are using pip version 22.0.4; however, version 22.2.2 is available.
You should consider upgrading via the 'C:\Program Files\Python39\python.exe -m pip install --upgrade pip' command.

Посмотрим версии библиотек

In [10]:
import numpy as np, pandas as pd, pyarrow
import matplotlib, seaborn as sns
import sklearn

for lib in (np, pd, pyarrow, matplotlib, sns, sklearn):
    print(lib.__name__, lib.__version__)

numpy 1.23.3
pandas 1.5.0
pyarrow 9.0.0
matplotlib 3.6.0
seaborn 0.12.0
sklearn 1.1.1

### Загрузим Titanic

- почитать про display
- дать ссылки на функции, похожие и тп
- в конце замечание про parquet
- в конце сранвение скоростей графиков

In [20]:
ttn_tr = pd.read_csv('titanic/train.csv')
ttn_tst = pd.read_csv('titanic/test.csv')

ttn_sample = pd.read_csv('titanic/gender_submission.csv')

from IPython.display import display

print('train data:')
display(ttn_tr.head(n=3))

print('test data:')
ttn_tst.head(3)

train data:

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

test data:

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q

In [31]:
print('train data:')
ttn_tr.info(memory_usage='deep')

print('\n-----------------------\n')

print('test data:')
ttn_tst.info(memory_usage='deep')

train data:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 315.0 KB

-----------------------

test data:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 144.8 KB

In [18]:
ttn_sample.head(n=3)

   PassengerId  Survived
0          892         0
1          893         1
2          894         0

### Загрузим Predict future sales

You are provided with daily historical sales data. The task is to forecast the total amount of products sold in every shop for the test set. Note that the list of shops and products slightly changes every month. Creating a robust model that can handle such situations is part of the challenge.

#### File descriptions
- **sales_train.csv** - the training set. Daily historical data from January 2013 to October 2015.
- **test.csv** - the test set. You need to forecast the sales for these shops and products for November 2015.
- **sample_submission.csv** - a sample submission file in the correct format.
- **items.csv** - supplemental information about the items/products.
- **item_categories.csv**  - supplemental information about the items categories.
- **shops.csv**- supplemental information about the shops.

#### Data fields
- **ID** - an Id that represents a (Shop, Item) tuple within the test set
- **shop_id** - unique identifier of a shop
- **item_id** - unique identifier of a product
- **item_category_id** - unique identifier of item category
- **item_cnt_day** - number of products sold. You are predicting a monthly amount of this measure
- **item_price** - current price of an item
- **date** - date in format dd/mm/yyyy
- **date_block_num** - a consecutive month number, used for convenience. January 2013 is 0, February 2013 is 1,..., October 2015 is 33
- **item_name** - name of item
- **shop_name** - name of shop
- **item_category_name** - name of item category

In [33]:
%%time
sales_train = pd.read_csv('future_sales/sales_train.csv')
sales_test = pd.read_csv('future_sales/test.csv')
items = pd.read_csv('future_sales/items.csv')
item_categories = pd.read_csv('future_sales/item_categories.csv')
shops = pd.read_csv('future_sales/shops.csv')

sales_sample = pd.read_csv('future_sales/sample_submission.csv')

CPU times: total: 1.22 s
Wall time: 1.22 s

In [36]:
sales_train.info(memory_usage='deep', show_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2935849 entries, 0 to 2935848
Data columns (total 6 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   date            2935849 non-null  object
 1   date_block_num  2935849 non-null  int64
 2   shop_id         2935849 non-null  int64
 3   item_id         2935849 non-null  int64
 4   item_price      2935849 non-null  float64
 5   item_cnt_day    2935849 non-null  float64
dtypes: float64(2), int64(3), object(1)
memory usage: 299.6 MB

In [39]:
for dataframe in (sales_train, items, item_categories, shops, sales_test):
    pr

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154       999.0           1.0